Repository: pamugk/soap-klient
Catalog: po/*.po
Languages: ru

source: <missing raw response data>
ru: <отсутствуют данные ответа>

source: WSDL Definition
ru: Определение WSDL

source: WSDL URL
ru: URL WSDL

source: Namespace
ru: Пространство имён

source: Binding
ru: Биндинг

source: SOAP Version
ru: Версия SOAP

source: Style
ru: Стиль

source: WS-A version
ru: Версия WS-A

source: Definition Parts
ru: Части определения

source: Operations
ru: Операции

source: Overview
ru: Обзор

source: Endpoint
ru: Эндпойнт

source: Username
ru: Логин

source: Password
ru: Пароль

source: Domain
ru: Домен

source: Outgoing WSS
ru: Исходящий WSS

source: Incoming WSS
ru: Входящий WSS

source: Mode
ru: Режим

source: Service Endpoints
ru: Эндпойнты сервиса

source: WSDL Content
ru: Содержимое WSDL

source: WS-I Compliance
ru: Соответствие WS-I

source: File
ru: Файл

source: Create empty project
ru: Создать пустой проект

source: New SOAP Project
ru: Новый SOAP проект

source: Import Project
ru: Импортировать проект

source: Import Packed Project
ru: Импортировать упакованный проект

source: Save All Projects
ru: Сохранить все проекты

source: Open All Closed Projects
ru: Открыть все закрытые проекты

source: Close All Open Projects
ru: Закрыть все открытые проекты

source: Rename Workspace
ru: Переименовать рабочее пространство

source: New Workspace
ru: Новое рабочее пространство

source: Switch Workspace
ru: Переключить рабочее пространство

source: Preferences
ru: Настройки

source: Save Preferences
ru: Сохранить настройки

source: Import Preferences
ru: Испортировать настройки

source: Recent
ru: Недавние

source: Editors
ru: Редакторы

source: empty
ru: пусто

source: Clear items
ru: Очистить список

source: Projects
ru: Проекты

source: Workspaces
ru: Рабочие пространства

source: Exit
ru: Выход

source: Exit Without Saving
ru: Выход без сохранения

source: Project
ru: Проект

source: Show Project View
ru: Открыть обзор проекта

source: Add WSDL
ru: Добавить WSDL

source: Add WADL
ru: Добавить WADL

source: Rename
ru: Переименовать

source: Remove
ru: Удалить

source: Reload Project
ru: Перезагрузить проект

source: Close Project
ru: Закрыть проект

source: Save Project
ru: Сохранить проект

source: Save Project As…
ru: Сохранить проект как…

source: Export Project
ru: Экспортировать проект

source: Executing SOAP request…
ru: Выполняется SOAP-запрос…

source: Project Summary
ru: Сводка по проекту

source: File Path
ru: Путь к файлу

source: Interface Summary
ru: Сводка по интерфейсу

source: Request completed successfully
ru: Запрос успешно выполнен

source: An error occured: %1
ru: Возникла ошибка: %1

source: SOAP Klient Preferences
ru: Настройки SOAP Klient

source: HTTP Settings
ru: Настройки HTTP

source: Proxy Settings
ru: Настройки прокси

source: SSL Settings
ru: Настройки SSL

source: WSDL Settings
ru: Настройки WSDL

source: UI Settings
ru: Настройки UI

source: Editor Settings
ru: Настройки редактора

source: Tools
ru: Инструменты

source: WS-I Settings
ru: Настройки WS-I

source: Global Properties
ru: Глобальный свойства

source: Global Security Settings
ru: Глобальные настройки безопасности

source: WS-A Settings
ru: Настройки WS-A

source: Global Sensitive Information Tokens
ru: Глобальные токены чувствительной информации

source: HTTP Version:
ru: Версия HTTP:

source: User-Agent Header:
ru: Заголовок User-Agent:

source: Request compression:
ru: Сжатие запроса:

source: None
ru: Нет

source: Response compression:
ru: Сжатие ответа:

source: Accept compressed responses from host
ru: Принимать сжатые ответы

source: Disable Response Decompression:
ru: Отключить восстановление ответа:

source: Disable decompression of compressed responses
ru: Отключить восстановление сжатых ответов

source: Close connections after request:
ru: Закрывать соединения после запроса:

source: Close the HTTP connection after each SOAP request
ru: Закрывать HTTP-соединения после каждого SOAP-запроса

source: Chunking Threshold:
ru: Порог деления на части:

source: Authenticate Preemptively:
ru: Предварительно аутентифицировать:

source: Adds authentication information to outgoing request
ru: Добавляет информацию для аутентификации в отправляемый запрос

source: Adds Expect-Continue header to outgoing request
ru: Добавляет заголовок Expect-Continue к отправляемым запросам

source: Pre-encoded Endpoints:
ru: Заранее закодированные эндпойнты

source: URI contains encoded endpoints, don't try to re-encode
ru: URI содержит уже закодированные эндпойнты

source: Normalize Forward Slashes:
ru: Нормализация прямых слэшей:

source: Replaces duplicate forward slashes in HTTP request endpoints with a single slash
ru: Заменяет в эндпойнтах HTTP-запросов дублирующиеся прямые слэши одним слэшем

source: Bind Address:
ru: Адрес привязки:

source: Include request in time taken:
ru: Включить запрос во время выполнения:

source: Includes the time it took to write the request in time-taken
ru: Включает потраченное на отправку запроса время во время выполнения

source: Include response in time taken:
ru: Включить ответ во время выполнения:

source: Includes the time it took to read the entire response in time-taken
ru: Включить потраченное на чтение ответа время во время выполнения

source: Socket timeout (ms):
ru: Таймаут сокета (мс.):

source: Max response size:
ru: Максимальный размер ответа:

source: Max Connections Per Host:
ru: Максимум подключений к хосту:

source: Max Total Connections:
ru: Общее максимальное количество подключений:

source: Proxy Setting:
ru: Настройка прокси:

source: Automatic
ru: Автоматическая

source: Manual
ru: Ручная

source: Host:
ru: Хост:

source: Port:
ru: Порт:

source: Excludes:
ru: Исключая:

source: Username:
ru: Логин:

source: Password:
ru: Пароль:

source: KeyStore:
ru: Хранилище приватных ключей

source: KeyStore Password:
ru: Пароль к хранилищу приватных ключей

source: Client Authentication:
ru: Аутентификация клиента:

source: requires client authentication
ru: требовать аутентификацию клиента

source: Cache WSDLs:
ru: Сохранять WSDL:

source: caches and associates WSDLs locally for offline access and improved performance
ru: локально сохранять WSDL для оффлайн-доступа и улучшения производительности

source: Sample Values:
ru: Примеры значений:

source: generate example values in new requests
ru: генерировать примеры значений в новых запросах

source: Type Comment:
ru: Комментарий о типе:

source: generate comments with type information in new requests
ru: генерировать комментарии с информацией о типе в новых запросах

source: Include Optional:
ru: Учитывать необязательное:

source: always include optional schema elements when creating requests
ru: всегда учитывать необязательные элементы схемы при создании запросов

source: Pretty Print:
ru: Структурная распечатка:

source: pretty print response messages
ru: включить структурную распечатку содержимого ответов

source: Attachment Parts:
ru: Части приложений:

source: generate rpc message parts for attachments
ru: генерировать части сообщений RPC для приложений

source: Schema Directory:
ru: Директория схемы:

source: Name with Binding:
ru: Называть по биндингу:

source: uses the WSDL binding name (instead of portType) for imported interfaces
ru: использовать название биндинга из WSDL (вместо portType) для импортируемых интерфейсов

source: Strict schema types:
ru: Строгий контроль типов схемы:

source: fails schema imports if type/particles are redefined
ru: прекращать импорт схемы при выявлении переопределённых типов/частей

source: Compression Limit:
ru: Предел сжатия:

source: Pretty Print Project Files:
ru: Структурная распечатка файлов проекта:

source: pretty prints project files
ru: включить структурную распечатку файлов проекта

source: Trim WSDL:
ru: Прибирать WSDL:

source: Trims leading and trailing whitespaces from WSDL file (might not work on non 8 bit encoding)
ru: убирать ведущие и оконечные пробельные символы из файла WSDL (может не сработать на не-8-битных кодировках)

source: No Content-Type Validation:
ru: Отключить проверку Content-Type:

source: allow incorrect content-types in mime-attachments
ru: разрешить некорректные типы содержимого в приложениях

source: Excluded types:
ru: Исключаемые типы:

source: Close Projects:
ru: Закрывать проекты:

source: Close all projects on startup
ru: Закрывать все проекты при запуске

source: Order Projects:
ru: Упорядочивать проекты:

source: Order Projects alphabetically in tree
ru: Упорядочивать проекты в дереве по алфавиту

source: Order Services:
ru: Упорядочивать сервисы:

source: Order Services alphabetically in tree
ru: Упорядочивать сервисы в дереве по алфавиту

source: Order Requests:
ru: Упорядочивать запросы:

source: Order Requests alphabetically in tree
ru: Упорядочивать запросы в дереве по алфавиту

source: Show Descriptions:
ru: Отображать описания:

source: Show description content when available
ru: Отображать описательный контент (при наличии)

source: Save projects on exit:
ru: Сохранять проекты при выходе:

source: Save all projects on exit
ru: Сохранять все проекты при выходе

source: Create Backup:
ru: Создавать резервные копии:

source: Backup project files before they are saved
ru: Создавать резервные копии файлов проектов перед их сохранением

source: Backup Folder:
ru: Папка для резервных копий:

source: AutoSave Interval:
ru: Интервал автосохранения:

source: Native LF:
ru: Нативный вид:

source: Use native Look & Feel (requires restart)
ru: Использовать нативный вид (требуется перезапуск)

source: Show Log Tabs:
ru: Отображать вкладки логов:

source: Shows log tabs when starting
ru: Отображать вкладки логов при запуске

source: Show Startup Page:
ru: Отображать стартовую страницу:

source: Open startup web page when starting
ru: Открывать стартовую страницу при запуске

source: Disable Tooltips:
ru: Отключить всплывающие подсказки

source: Disables all tooltips
ru: Отключает все всплывающие подсказки

source: Normalize line-break:
ru: Нормализовать переводы строк:

source: Normalize line-breaks when saving project
ru: Нормализовать переводы строк при сохранении проекта

source: Garbage Collection Interval (s):
ru: Интервал сборки мусора (с.):

source: Size of Raw Response Message to Show:
ru: Размер отображаемой части необработанных данных ответа:

source: Size of Raw Request Message to Show:
ru: Размер отображаемой части необработанных данных ответа:

source: Wrap content in Raw Message Viewers:
ru: Переносить строки содержимого необработанных данных:

source: Wraps content in Raw Message Viewers
ru: Включить перенос строк отображаемого содержимого необработанных данных

source: Disable Usage Statistics:
ru: Отключить статистику использования:

source: Do not send usage statistics
ru: Не отсылать статистику использования

source: Editor Font:
ru: Шрифт редактора:

source: XML Line Numbers:
ru: Номера строк XML

source: Show line numbers in XML editors by default
ru: По умолчанию отображать номера строк в редакторе XML

source: Disable auto-resize:
ru: Отключить автоматическое изменение размера:

source: Disables automatic resizing of Request editors
ru: Отключить автоматическое изменение размера редактора запросов

source: Tabbed request view:
ru: Вид на основе вкладок:

source: Defaults the request editor to the tabbed layout
ru: По умолчанию использовать редактор с макетом на основе вкладок

source: Validate Requests:
ru: Проверять запросы:

source: Always validate request messages before they are send
ru: Всегда проверять содержимое запросов перед отправкой

source: Abort on invalid:
ru: Прерывать по некорректности:

source: Abort invalid requests
ru: Прерывать выполнение некорректных запросов

source: Validate Responses:
ru: Проверять ответы:

source: Always validate response messages
ru: Всегда проверять содержимое ответов

source: Verbose:
ru: Подробности:

source: Verbose output of WSI tools
ru: Включить подробный вывод инструментов WSI

source: Profile:
ru: Профиль:

source: Correlation:
ru: Корреляция:

source: endpoint
ru: эндпойнт

source: namespace
ru: пространство имён

source: operation
ru: операция

source: Message entry:
ru: Содержимое сообщения:

source: Message entriies should be included in the report
ru: Содержимое сообщений должно быть включено в отчёт

source: Failure message:
ru: Сообщение об ошибке:

source: Failure message defined for each test assertion should be included in the report
ru: Заданное для каждой тестовой проверки сообщение об ошибке должно быть включено в отчёт

source: Assertion description:
ru: Описание сопоставления:

source: Description of each test assertion should be included in the report
ru: Описание каждого тестового сопоставления должно быть включено в отчёт

source: Tool location:
ru: Расположение инструмента:

source: Show log:
ru: Отображать вывод:

source: Show console-log for ws-i analyzer
ru: Отображать консольный вывод анализатора ws-i

source: Output folder:
ru: Папка для результатов:

source: Enables overriding of any property-reference with global properties
ru: Включить переопределение любых ссылок на свойства глобальными свойствами

source: Name
ru: Название

source: Value
ru: Значение

source: Disable the Load and Save scripts:
ru: Отключить скрипты на загрузку и сохранение:

source: Do not run the Load and Save scripts on opening and saving projects
ru: Не выполнять скрипты на загрузку и сохранение при открытии и сохранении проектов

source: Soap action overrides wsa action:
ru: Переопределение WSA-действия SOAP-действием:

source: Soap action if present overrides wsa action
ru: SOAP-действие должно переопределять WSA-действие (при наличии)

source: Use default Relationship Type:
ru: Использовать тип отношения по умолчанию:

source: Use default 'reply' for RelationshipType
ru: По умолчанию использовать 'reply' в качестве значения RelationshipType

source: Use default RelatesTo:
ru: Использовать RelatesTo по умолчанию:

source: Use default 'unspecified' for Relates To
ru: По умолчанию использовать 'unspecified' в качестве значения RelatesTo

source: Override existing headers:
ru: Переопределять существующие заголовки:

source: Replaces existing WS-A headers (or skips them if unchecked)
ru: Переопределять существующие заголовки WS-A (или пропускать их, если опция не выбрана)

source: Enable for optional Addressing policy:
ru: Включить для политики необязательной адресации:

source: Enables WS-Addressing for Addressing Optional='true'
ru: Включать WS-Addressing, когда Addressing Optional='true'

source: Token
ru: Токен

source: Description
ru: Описание

source: Adds a property to the property list
ru: Добавить свойство

source: Removes the selected property from the property list
ru: Удалить свойство из списка свойств

source: Moves the selected property up one item
ru: Переместить выбранное свойство на одну позицию вверх

source: Moves the selected property down one item
ru: Переместить выбранное свойство на одну позицию вниз

source: Clears all current property values
ru: Очистить значения всех свойств

source: Loads property values from an external file
ru: Загрузить значения свойств из файла

source: Saves current property-values to a file
ru: Сохраняет свойства и их значения в файл

source: <missing raw request data>
ru: <отсутствуют данные запроса>

source: Submit request to specified endpoint URL
ru: Отправить запрос по указанному URL эндпойнта

source: Abort ongoing request
ru: Прервать выполняющийся запрос

source: Open-source GUI SOAP client, somewhat compatible with SoapUI
ru: Графический SOAP-клиент с открытым исходным кодом, отчасти совместимый с SoapUI

source: Simple application to test SOAP services
ru: Простое приложение для тестирование SOAP-сервисов
